bbetter173/AugmentOS/mcu_client/nrf5340_ble_simulator/src/mos_components/mos_button/src/mos_button_app.c
/*
 * @Author       : Cole
 * @Date         : 2026-01-24 11:14:00
 * @LastEditTime : 2026-02-05 14:21:41
 * @FilePath     : mos_button_app.c
 * @Description  :
 *
 *  Copyright (c) MentraOS Contributors 2026
 *  SPDX-License-Identifier: Apache-2.0
 */

#include "mos_button_app.h"

#include <display/lcd/a6n.h>  // For a6n_power_off()
#include <hal/nrf_gpio.h> /* For direct GPIO control | 直接GPIO控制 */
#include <helpers/nrfx_reset_reason.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/poweroff.h>

#include "interrupt_handler.h"
#include "mos_button.h"
#include "mos_lsm6dsv16x.h"
#include "mos_lvgl_display.h"
#include "mos_npm1300_ldsw.h"
#include "mos_opt3006.h"

/* External function from main.c | 来自main.c的外部函数 */
extern void configure_default_low_pins(void);
extern void vad_power_control(bool enable);
extern void ear_en_control(bool enable);

LOG_MODULE_REGISTER(mos_button_app, LOG_LEVEL_INF);

/* Button press detection parameters | 按键按下检测参数 */
#define BUTTON_LONG_PRESS_MS 2500  // Long press threshold: 2.5 seconds | 长按阈值：2.5秒
#define BUTTON_POLL_INTERVAL_MS 50  // Polling interval: 50ms | 轮询间隔：50ms
#define BUTTON_DEBOUNCE_MS 20  // Debounce time: 20ms | 消抖时间：20ms

/* Button state tracking | 按键状态跟踪 */
static bool button_app_initialized = false;
static mos_button_app_callback_t button_app_callback = NULL;
static struct k_work_delayable button_poll_work;  // 50ms定时器用于轮询按键状态 | 50ms timer for polling button state
static bool button_press_detected = false;
static int64_t button_press_start_time = 0;  // 按键按下开始时间 | Button press start time
static bool peripherals_turned_off = false;  // 外设是否已关闭 | Whether peripherals are turned off
static int64_t wakeup_button_press_time = 0;  // 唤醒时按键按下的时间（如果已按下）| Button press time on wakeup (if
                                              // already pressed)
static bool button_released_after_wakeup = false;  // 唤醒后按键是否已释放（用于判断是否可以进入休眠逻辑）| Whether
                                                   // button was released after wakeup (for sleep logic)
static bool button_was_released_before_press = false;  // 按键在当前按下前是否已释放（用于休眠逻辑）| Whether button was
                                                       // released before current press (for sleep logic)

/**
 * @brief Button polling handler | 按键轮询处理
 *
 * Called every 50ms to check button state and accumulate press time | 每50ms调用一次检查按键状态并累计按下时间
 * Logic:
 * - If button is pressed: accumulate time, if >= 2.5s, turn off peripherals
 * - If button is released:
 *   - If peripherals already turned off (>= 2.5s pressed): enter sleep
 *   - If peripherals not turned off (< 2.5s pressed): short press, cancel timer, re-enable interrupt
 * 逻辑：
 * - 如果按键按下：累计时间，如果>=2.5s，关闭外设
 * - 如果按键松开：
 *   - 如果外设已关闭（>=2.5s按下）：进入休眠
 *   - 如果外设未关闭（<2.5s按下）：短按，取消定时器，重新使能中断
 */
static void button_poll_handler(struct k_work* work)
{
    ARG_UNUSED(work);

    if (!button_press_detected)
    {
        /* Button press was cancelled or reset | 按键按下已取消或重置 */
        return;
    }

    /* Check button state using GPIO polling (interrupt is disabled) | 使用GPIO轮询检查按键状态（中断已禁用）*/
    bool is_pressed = mos_button_is_pressed();

    if (!is_pressed)
    {
        /* Button is released - check if long press was completed | 按键已释放 - 检查是否已完成长按 */
        if (peripherals_turned_off)
        {
            /* Long press completed (>= 2.5s) and button released - enter sleep | 长按已完成（>=2.5s）且按键已释放 -
             * 进入休眠 */
            LOG_INF("✅ Button released after long press (2.5s+) - entering System OFF sleep");
            button_press_detected = false;
            button_press_start_time = 0;
            peripherals_turned_off = false;
            /* Note: button_was_released_before_press will be set to true after device wakes up |
             * 注意：button_was_released_before_press将在设备唤醒后设置为true */
            mos_button_app_enter_sleep();
            /* Should not reach here | 不应该到达这里 */
            return;
        }
        else
        {
            /* Short press detected (released before 2.5s) - cancel polling, re-enable interrupt |
             * 检测到短按（在2.5s前释放）- 取消轮询，重新使能中断 */
            int64_t press_duration = k_uptime_get() - button_press_start_time;
            LOG_INF("Button short press detected (duration: %lld ms, < 2.5s) - cancelling polling, re-enabling interrupt", press_duration);
            
            /* Cancel polling timer | 取消轮询定时器 */
            k_work_cancel_delayable(&button_poll_work);

            /* Reset button state | 重置按键状态 */
            button_press_detected = false;
            button_press_start_time = 0;
            peripherals_turned_off = false;

            /* Mark button as released (for sleep logic - next press can trigger sleep) | 标记按键已释放（用于休眠逻辑 -
             * 下次按下可以触发休眠）*/
            button_was_released_before_press = true;

            /* Re-enable interrupt for next button event | 重新使能中断以便下次按键事件 */
            int ret = mos_button_re_enable_interrupt();
            if (ret != 0)
            {
                LOG_ERR("Failed to re-enable button interrupt: %d", ret);
            }

            /* Call short press callback if registered | 如果已注册，调用短按回调 */
            if (button_app_callback != NULL)
            {
                button_app_callback(MOS_BUTTON_PRESS_SHORT);
            }

            return;
        }
    }
    /* Button is still pressed - calculate press duration from interrupt time | 按键仍按下 - 计算从中断触发到现在的时长
     */
    int64_t press_duration = k_uptime_get() - button_press_start_time;
    LOG_DBG("Button polling: press_duration = %lld ms, peripherals_turned_off = %d", press_duration,
            peripherals_turned_off);

    if (press_duration >= BUTTON_LONG_PRESS_MS && !peripherals_turned_off)
    {
        LOG_INF("✅ Button long press (2.5s) detected - turning off peripherals");
        vad_power_control(false);  // Disable VAD power control | 禁用VAD电源控制
        ear_en_control(false);
        // opt3006_set_mode(OPT3006_MODE_SHUTDOWN);  // Shutdown OPT3006 | 关闭 OPT3006
        mos_npm1300_ldsw1_disable();
        opt3006_prepare_for_sleep();
        lsm6dsv16x_sleep();
        set_display_onoff(false);  // Set display state to off | 设置显示状态为关闭
        a6n_power_off();  // Turn off A6N display power | 关闭A6N显示电源
        a6n_io_off();  // Turn off A6N I/O power | 关闭A6N I/O电源
        peripherals_turned_off = true;
        LOG_INF("Peripherals turned off, waiting for button release to enter sleep");
    }

