bbetter173/AugmentOS/mcu_client/nrf5340_ble_simulator/src/mos_components/mos_button/src/mos_button_app.c
    /* Continue polling (schedule next check in 50ms) | 继续轮询（50ms后再次检查）*/
    k_work_schedule(&button_poll_work, K_MSEC(BUTTON_POLL_INTERVAL_MS));
}

/**
 * @brief Default button event handler | 默认按键事件处理函数
 *
 * Note: Long press (2500ms) = enter sleep (handled in timeout handler)
 * 注意：长按（2500ms）= 进入休眠（在超时处理函数中处理）
 * Short press = reserved for future use
 * 短按 = 保留用于其他功能
 */
static void button_default_event_handler(mos_button_press_type_t press_type)
{
    if (press_type == MOS_BUTTON_PRESS_LONG)
    {
        /* This should not be called anymore - long press is handled in timeout handler | 这不应该再被调用 -
         * 长按在超时处理函数中处理 */
        LOG_WRN("Button long press callback called (should be handled in timeout handler)");
    }
    else if (press_type == MOS_BUTTON_PRESS_SHORT)
    {
        LOG_DBG("Button short press: Reserved for future use");
        /* Short press can be used for other functions | 短按可用于其他功能 */
    }
}

/**
 * @brief Interrupt handler callback for button events | 按键事件的中断处理回调
 *
 * This is called from the interrupt processing thread context | 从中断处理线程上下文调用
 */
static void button_interrupt_callback(interrupt_event_t* event)
{
    if (event == NULL)
    {
        return;
    }

    switch (event->event)
    {
        case INTERRUPT_TYPE_BUTTON_PRESSED:
        {
            int64_t interrupt_time = k_uptime_get();
            LOG_INF("Button interrupt received - configuring for polling, starting 20ms debounce");

            int ret = mos_button_configure_for_polling();
            if (ret != 0)
            {
                LOG_ERR("Failed to configure button GPIO for polling: %d", ret);
                break;
            }
            k_sleep(K_MSEC(BUTTON_DEBOUNCE_MS));

            bool is_pressed = mos_button_is_pressed();

            if (!is_pressed)
            {
                /* Button is released after debounce - ignore as bounce | 消抖后按键已释放 - 忽略（可能是抖动）*/
                LOG_INF("Button released after debounce (20ms) - ignoring as bounce (raw GPIO = %d)", is_pressed);

                ret = mos_button_re_enable_interrupt();
                if (ret != 0)
                {
                    LOG_ERR("Failed to re-enable button interrupt: %d", ret);
                }
                break;
            }

            /* Check if button was released after wakeup (for sleep logic) | 检查唤醒后按键是否已释放（用于休眠逻辑）*/
            /* If device just woke up and button is still pressed from wakeup, ignore this press |
             * 如果设备刚唤醒且按键仍从唤醒时按下，忽略此次按下 */
            if (!button_released_after_wakeup)
            {
                LOG_INF("Button pressed but not released after wakeup yet - ignoring this press (need release first)");
                ret = mos_button_re_enable_interrupt();
                if (ret != 0)
                {
                    LOG_ERR("Failed to re-enable button interrupt: %d", ret);
                }
                break;
            }

            /* Check if button was released before this press (for sleep logic) |
             * 检查按键在当前按下前是否已释放（用于休眠逻辑）*/
            /* Only allow sleep logic if button was released before current press |
             * 只有按键在当前按下前已释放，才允许休眠逻辑 */
            if (!button_was_released_before_press)
            {
                LOG_INF("Button pressed but was not released before this press - ignoring for sleep logic");
                ret = mos_button_re_enable_interrupt();
                if (ret != 0)
                {
                    LOG_ERR("Failed to re-enable button interrupt: %d", ret);
                }
                break;
            }

            /* Initialize button press tracking | 初始化按键按下跟踪 */
            button_press_detected = true;
            button_press_start_time = interrupt_time;  // Use interrupt time as start time | 使用中断时间作为开始时间
            peripherals_turned_off = false;
            button_was_released_before_press = false;  // Reset flag | 重置标志

            k_work_schedule(&button_poll_work, K_MSEC(BUTTON_POLL_INTERVAL_MS));
        }
        break;
        default:
            LOG_WRN("Unknown button interrupt event type: %u", event->event);
            break;
    }
}

int mos_button_app_init(void)
{
    int ret;

    if (button_app_initialized)
    {
        LOG_WRN("Button app already initialized");
        return 0;
    }

    /* Initialize button driver | 初始化按键驱动 */
    ret = mos_button_init();
    if (ret != 0)
    {
        LOG_ERR("Failed to initialize button driver: %d", ret);
        return ret;
    }

    /* If not waking from sleep (normal power-on), button is considered released |
     * 如果不是从休眠唤醒（正常上电），按键被视为已释放 */
    /* Note: wakeup_button_press_time > 0 means we woke from sleep with button pressed | 注意：wakeup_button_press_time
     * > 0 表示我们从休眠唤醒时按键已按下 */
    if (wakeup_button_press_time == 0)
    {
        button_released_after_wakeup = true;
        button_was_released_before_press = true;  // Normal power-on, button is released | 正常上电，按键已释放
        LOG_INF("Normal power-on detected - button sleep logic enabled");
    }
    else
    {
        /* Waking from sleep - button_released_after_wakeup will be set in mos_button_app_wait_for_power_on() |
         * 从休眠唤醒 - button_released_after_wakeup将在mos_button_app_wait_for_power_on()中设置 */
        button_released_after_wakeup = false;
        button_was_released_before_press = false;  // Waking from sleep, button may still be pressed |
                                                   // 从休眠唤醒，按键可能仍按下
        LOG_INF("Waking from sleep - button sleep logic will be enabled after power-on confirmation");
    }

    /* Initialize work for button polling (50ms interval) | 初始化按键轮询工作（50ms间隔）*/
    k_work_init_delayable(&button_poll_work, button_poll_handler);

    /* Check if interrupt handler framework is initialized | 检查中断处理框架是否已初始化 */
    if (!interrupt_handler_is_initialized())
    {
        LOG_ERR("Interrupt handler framework not initialized. Call interrupt_handler_init() first.");
        return -ENODEV;
    }

    /* Register interrupt callbacks for button events | 为按键事件注册中断回调 */
    ret = interrupt_handler_register_callback(INTERRUPT_TYPE_BUTTON_PRESSED, button_interrupt_callback);
    if (ret != 0)
    {
        LOG_ERR("Failed to register button pressed interrupt callback: %d", ret);
        return ret;
    }

