bbetter173/AugmentOS/mcu_client/nrf5340_ble_simulator/src/mos_components/mos_button/src/mos_button_app.c
    button_app_callback = button_default_event_handler;
    LOG_INF("Default button handler registered: long press (2500ms) = enter sleep, short press = reserved");

    button_app_initialized = true;
    LOG_INF("Button application logic initialized (using interrupt handler framework)");

    return 0;
}

int mos_button_app_register_callback(mos_button_app_callback_t callback)
{
    if (callback == NULL)
    {
        return -EINVAL;
    }

    button_app_callback = callback;
    LOG_INF("Button app callback registered");
    return 0;
}

void mos_button_app_unregister_callback(void)
{
    button_app_callback = NULL;
    LOG_INF("Button app callback unregistered");
}

/**
 * @brief Prepare device for sleep - turn off all peripherals and configure wakeup | 准备设备进入休眠 -
 * 关闭所有外设并配置唤醒
 * @param turn_off_peripherals Whether to turn off peripherals (display, VAD, LDSW1) | 是否关闭外设（显示、VAD、LDSW1）
 * @return 0 on success, negative error code on failure
 * @return 成功返回0，失败返回负数错误码
 * @note This function should be called before sys_poweroff() to ensure proper sleep preparation | 此函数应在
 * sys_poweroff() 之前调用以确保正确的休眠准备
 */
static int prepare_for_sleep(bool turn_off_peripherals)
{
    int ret;

    LOG_INF("Preparing device for System OFF sleep mode...");

    /* Turn off peripherals if requested | 如果请求，关闭外设 */
    if (turn_off_peripherals)
    {
        LOG_INF("Turning off peripherals before sleep...");

        vad_power_control(false);
        ear_en_control(false);
        /* Disable LDSW1 | 禁用LDSW1 */
        
        /* Put OPT3006 into shutdown mode | 关闭 OPT3006 */
        // opt3006_set_mode(OPT3006_MODE_SHUTDOWN);
        opt3006_prepare_for_sleep();
        lsm6dsv16x_sleep();
        mos_npm1300_ldsw1_disable();
        /* Turn off display | 关闭显示 */
        set_display_onoff(false);  // Set display state to off | 设置显示状态为关闭
        a6n_power_off();  // Turn off A6N display power | 关闭A6N显示电源
        a6n_io_off();  // Turn off A6N I/O power | 关闭A6N I/O电源

        LOG_INF("All peripherals turned off");
    }
    else
    {
        vad_power_control(false);  // Disable VAD power control | 禁用VAD电源控制
    }

    /* Ensure all default LOW pins are LOW before sleep | 睡眠前确保所有默认拉低的引脚为低电平 */
    configure_default_low_pins();
    /* Configure button for System OFF wakeup | 配置按键用于System OFF唤醒 */
    ret = mos_button_configure_wakeup();
    if (ret != 0)
    {
        LOG_ERR("Failed to configure button for wakeup: %d", ret);
        return ret;
    }

    LOG_INF("Device prepared for sleep");
    return 0;
}

int mos_button_app_enter_sleep(void)
{
    int ret;

    if (!button_app_initialized)
    {
        LOG_ERR("Button app not initialized");
        return -ENODEV;
    }

    LOG_INF("Preparing to enter System OFF sleep mode...");

    /* Cancel any pending button work | 取消任何待处理的按键工作 */
    k_work_cancel_delayable(&button_poll_work);

    /* Reset button state flags | 重置按键状态标志 */
    button_press_detected = false;
    button_press_start_time = 0;
    peripherals_turned_off = false;

    /* Unregister interrupt callbacks | 注销中断回调 */
    interrupt_handler_unregister_callback(INTERRUPT_TYPE_BUTTON_PRESSED, button_interrupt_callback);
    interrupt_handler_unregister_callback(INTERRUPT_TYPE_BUTTON_RELEASED, button_interrupt_callback);

    /* Prepare for sleep - peripherals may already be off from button handler | 准备休眠 - 外设可能已在按键处理中关闭 */
    ret = prepare_for_sleep(!peripherals_turned_off);
    if (ret != 0)
    {
        LOG_ERR("Failed to prepare for sleep: %d", ret);
        return ret;
    }

    LOG_INF("Entering System OFF sleep mode...");
    LOG_INF("Press button to wake up");

    /* Enter System OFF - this will not return | 进入System OFF - 这不会返回 */
    sys_poweroff();

    /* Should never reach here | 不应该到达这里 */
    return -EIO;
}

bool mos_button_app_is_waking_from_sleep(void)
{
    uint32_t reset_reason = nrfx_reset_reason_get();

    bool gpio_wakeup = (reset_reason & NRFX_RESET_REASON_OFF_MASK) != 0;

    if (gpio_wakeup)
    {
        /* Clear reset reason | 清除复位原因 */
        nrfx_reset_reason_clear(reset_reason);
        LOG_INF("Device waking from System OFF (GPIO wakeup), reset_reason: 0x%08X", reset_reason);
        return true;
    }
    else
    {
        /* Not a GPIO wakeup - could be power-on reset or other reset | 不是GPIO唤醒 - 可能是重新上电复位或其他复位 */
        if (reset_reason != 0)
        {
            LOG_INF("Device reset detected (not GPIO wakeup), reset_reason: 0x%08X - normal startup", reset_reason);
            /* Clear reset reason for other resets too | 也清除其他复位原因 */
            nrfx_reset_reason_clear(reset_reason);
        }
        else
        {
            LOG_INF("Device power-on reset detected (reset_reason: 0) - normal startup");
        }
        return false;
    }
}

bool mos_button_app_check_wakeup_state(void)
{
    bool woke_from_sleep = mos_button_app_is_waking_from_sleep();

    if (!woke_from_sleep)
    {
        wakeup_button_press_time = 0;
        return false;
    }

    /* 检查按键是否按下，如果按下则记录时间 | Check if button is pressed, record time if pressed */
    const struct gpio_dt_spec button_gpio = GPIO_DT_SPEC_GET(DT_PATH(zephyr_user), button_gpios);

    if (!gpio_is_ready_dt(&button_gpio))
    {
        gpio_pin_configure_dt(&button_gpio, GPIO_INPUT | GPIO_PULL_UP);
        k_sleep(K_MSEC(5));
    }

    int val = gpio_pin_get(button_gpio.port, button_gpio.pin);
    if (val == 0)  // Button is active low | 按键为低电平有效
    {
        wakeup_button_press_time = k_uptime_get();
        LOG_INF("Button pressed on wakeup - recorded time: %lld ms", wakeup_button_press_time);
    }
    else
    {
        wakeup_button_press_time = 0;
    }

    return woke_from_sleep;
}

int mos_button_app_wait_for_power_on(uint32_t timeout_ms)
{
    int ret;
    bool long_press_detected = false;
    int64_t current_time = k_uptime_get();
    int64_t timeout_time = current_time + timeout_ms;
    int64_t button_press_start_time = 0;
    bool button_was_pressed = false;
    bool long_press_reached = false;  // Flag to track if 2.5s has been reached | 标志：是否已达到2.5s

    LOG_INF("Waiting for button long press (2500ms) to power on...");
    LOG_INF("Press and hold button for 2.5 seconds to start device");

