bbetter173/AugmentOS/mcu_client/nrf5340_ble_simulator/src/mos_components/mos_button/src/mos_button_app.c
    ret = mos_button_init();
    if (ret != 0)
    {
        LOG_ERR("Failed to initialize button driver: %d", ret);
        return ret;
    }

    /* Check if button was already pressed on wakeup (recorded by mos_button_app_check_wakeup_state) |
     * 检查唤醒时按键是否已按下（由mos_button_app_check_wakeup_state记录）*/
    if (wakeup_button_press_time > 0)
    {
        /* Button was already pressed on wakeup - calculate elapsed time | 唤醒时按键已按下 - 计算已过去的时间 */
        int64_t elapsed_time = current_time - wakeup_button_press_time;
        LOG_INF("Button already pressed on wakeup - elapsed time: %lld ms (recorded at %lld ms, current %lld ms)",
                elapsed_time, wakeup_button_press_time, current_time);

        /* If already pressed for 2.5s or more, power on immediately (don't wait for release) |
         * 如果已经按下2.5秒或更久，立即开机（不等待释放）*/
        if (elapsed_time >= BUTTON_LONG_PRESS_MS)
        {
            /* Already pressed for 2.5s+ - power on immediately | 已经按下2.5秒+ - 立即开机 */
            LOG_INF("Button already pressed for %lld ms (>= 2500ms) - power on confirmed immediately", elapsed_time);
            wakeup_button_press_time = 0;  // Clear wakeup time | 清除唤醒时间
            return 0;  // Success | 成功
        }
        else
        {
            /* Still need to wait for remaining time | 仍需要等待剩余时间 */
            /* Use wakeup time as start time, so press_duration calculation will be correct |
             * 使用唤醒时间作为开始时间，这样按下时长计算将是正确的 */
            button_press_start_time = wakeup_button_press_time;
            button_was_pressed = true;
            long_press_reached = false;  // Not reached 2.5s yet | 尚未达到2.5秒
            wakeup_button_press_time = 0;  // Clear wakeup time | 清除唤醒时间
            LOG_INF("Need to wait for remaining time: %lld ms (already waited %lld ms)",
                    BUTTON_LONG_PRESS_MS - elapsed_time, elapsed_time);
        }
    }
    else
    {
        /* Button was not pressed on wakeup - check current state | 唤醒时按键未按下 - 检查当前状态 */
        k_sleep(K_MSEC(10));  // Small delay for GPIO stabilization | 小延迟用于GPIO稳定

        if (!mos_button_is_pressed())
        {
            /* Button is not pressed - short press wakeup, enter sleep again | 按键未按下 - 短按唤醒，再次进入休眠 */
            LOG_INF("Button not pressed after wakeup (short press detected) - entering sleep again");

            ret = prepare_for_sleep(true);
            if (ret != 0)
            {
                LOG_ERR("Failed to prepare for sleep: %d", ret);
                return ret;
            }

            LOG_INF("Entering System OFF sleep mode (short press wakeup)...");
            sys_poweroff();
            return -EIO;
        }

        /* Button is now pressed - start timing now | 按键现在按下 - 现在开始计时 */
        LOG_INF("Button pressed after wakeup - starting long press detection");
        button_press_start_time = k_uptime_get();
        button_was_pressed = true;
        long_press_reached = false;  // Not reached 2.5s yet | 尚未达到2.5秒
    }

    while (!long_press_detected && (k_uptime_get() < timeout_time))
    {
        bool button_is_pressed = mos_button_is_pressed();
        int64_t current_time = k_uptime_get();

        if (button_is_pressed)
        {
            if (!button_was_pressed)
            {
                /* Button just pressed - record start time | 按键刚按下 - 记录开始时间 */
                button_press_start_time = current_time;
                button_was_pressed = true;
                long_press_reached = false;
                LOG_INF("Button pressed, starting long press detection (need 2.5s, then release)");
            }
            else
            {
                int64_t press_duration = current_time - button_press_start_time;

                if (press_duration >= BUTTON_LONG_PRESS_MS && !long_press_reached)
                {
                    /* Long press duration reached (2.5s) - power on immediately (don't wait for release) |
                     * 达到长按时长（2.5s）- 立即开机（不等待释放）*/
                    LOG_INF(
                        "Button long press (2500ms) reached (total duration: %lld ms) - power on confirmed immediately",
                        press_duration);
                    long_press_reached = true;
                    long_press_detected = true;  // Mark as detected, will exit loop | 标记为已检测，将退出循环
                    break;  // Exit loop immediately | 立即退出循环
                }
            }
        }
        else
        {
            if (button_was_pressed)
            {
                /* Button was released | 按键已释放 */
                int64_t press_duration = current_time - button_press_start_time;

                if (press_duration < BUTTON_LONG_PRESS_MS)
                {
                    /* Released before 2.5s - enter sleep again | 在2.5s前释放 - 再次进入休眠 */
                    LOG_INF("Button released after %lld ms (need 2500ms) - entering sleep again", press_duration);

                    /* Prepare for sleep with full peripheral shutdown (same as long press sleep) |
                     * 准备休眠并完全关闭外设（与长按休眠相同）*/
                    ret = prepare_for_sleep(true);
                    if (ret != 0)
                    {
                        LOG_ERR("Failed to prepare for sleep: %d", ret);
                        return ret;
                    }

                    LOG_INF("Entering System OFF sleep mode...");
                    sys_poweroff();
                    /* Should not reach here | 不应该到达这里 */
                    return -ETIMEDOUT;
                }
                else if (long_press_reached)
                {
                    /* Released after 2.5s - condition met! | 在2.5s后释放 - 条件满足！ */
                    LOG_INF("Button released after long press (2.5s+, total: %lld ms) - powering on device",
                            press_duration);
                    long_press_detected = true;
                    break;
                }
                else
                {
                    /* This shouldn't happen - button was pressed but long_press_reached is false | 这不应该发生 -
                     * 按键已按下但long_press_reached为false */
                    LOG_WRN("Button released but long_press_reached is false (duration: %lld ms)", press_duration);
                    button_was_pressed = false;
                    button_press_start_time = 0;
                }
            }
        }

        /* Use shorter polling interval for faster response (reduced from 50ms to 20ms) |
         * 使用更短的轮询间隔以加快响应（从50ms减少到20ms）*/
        k_sleep(K_MSEC(20));  // Check every 20ms for faster response | 每20ms检查一次以加快响应
    }

    /* If timeout reached but button is still pressed after 2.5s, power on immediately |
     * 如果超时但按键在2.5s后仍按下，立即开机 */
    if (!long_press_detected && long_press_reached)
    {
        LOG_INF("Timeout reached but button still pressed after 2.5s - powering on device immediately");
        long_press_detected = true;
    }

    if (long_press_detected)
    {
        LOG_INF("Power-on long press confirmed - device will start normally");

        /* Mark button as released after wakeup (for sleep logic) | 标记唤醒后按键已释放（用于休眠逻辑）*/
        button_released_after_wakeup = true;
        /* Note: button_was_released_before_press will be set to true when button is actually released |
         * 注意：button_was_released_before_press将在按键实际释放时设置为true */
        LOG_INF("Power-on confirmed - ready for normal operation");

        return 0;
    }
    else
    {
        LOG_WRN("Power-on long press not detected within timeout (%u ms) - entering sleep again", timeout_ms);
        return -ETIMEDOUT;
    }
}
